class Person < ActiveRecord::Base
  belongs_to :country

  NORMAL_HAIR = { 'черн' => 'черный', 'черн+волнистый' => 'черный волнистый', 'шатен+волн' => 'шатен волнистый',
      'блонд' => 'блондин', 'шатен' => 'шатен', 'рыжий' => 'рыжий' }
  NORMAL_BODY = {'худой' => 'худое', 'нормальный' => 'нормальное', 'полный' => 'полное'}
  HAIR_SCALE = { 'черный' => 1, 'черный волнистый' => 2, 'шатен' => 3, 'шатен волнистый' => 4, 'рыжий' => 5,
      'блондин' => 6 }
  BODY_SCALE = { 'худое' => 1, 'нормальное' => 2, 'полное' => 3 }
  RANGES = { height: 138..184, weight: 40..95, hair_color: 1..6, body_type: 1..3}
end
